{
  "description": {
    "javascript": "Writing non-worth npm packages and web app. I understand the basic specifications such as spread syntax and type behavior.",
    "typescript": "Mainly in Svelte project, or as an altJS. Following up the basic specifications like Type definition.",
    "svelte": "The only JS framework I'm familiar with. Localization, TS/SCSS plugin, Formatter&Linter plugin(Eslint, Prettier).",
    "html": "I'm not currently use HTML to make website, but I almost understand the specifications of HTML5 such as SRI and APIs",
    "css": "I have enough knowledge of CSS to use in Web design.",
    "scss": "I almost use SCSS for stylesheet currently. I understand general specifications like mixin and template.",
    "python": "For web scraping with Selenium/BeautifulSoup4. Automate the Boring Stuff with Python - Somebody famous",
    "firebase": "Mainly Authentication, Firestore and Realtime Database.",
    "docker": "Writing Dockerfile, build&run container. I am currently not so familiar with it that I can't rewrite other's dockerfile for my local environment, and I keep studying.",
    "git": "I've contributed to some OSS project on GitHub, so I have enough knowledge to develop in a joint effort.",
    "vagrant": "I use Vagrant mainly for ns3. I can build normal environment with vagrant, I mainly use Docker though.",
    "heroku": "Mainly for web app based on Node.js."
  },
  "memberof": {
    "code_for_japan": "Working as a event management intern.",
    "sgg": "The student organization in Japan. If you want to join SGG, contact me on Twitter!"
  },
  "education": {
    "keio": "The private high school in Yokohama, Kanagawa. The 2nd grade (Sophomore) now."
  },
  "interests": "I've been researching <a href=\"https://www.w3.org/TR/did-core/\">DID(Decentralized Identifiers)</a> and <a href=\"https://www.w3.org/TR/vc-data-model/\">VC(Verifiable Credentials)</a> as my senior thesis in high school. I've just started reading specifications of DID/VC, and I will study with SGG members.<br>Since I also have interest in Network Architecture and Security, I've been studying the fundamental cryptographic algorithm and logic, congestion control of TCP.<br>Furthermore, I'm going to study more the basic knowledges a web developer has to have (Docker,AWS etc..).",
  "mywork": {
    "neornd": "neornd makes Math.random() simple and safe by using crypto module. You can get a random number with number of decimal place you want easily.",
    "multimd": "Multi-MD is a markdown web editor. On Chrome, you can overwrite you local markdown file. PWA is available.",
    "percom": "Percom is a calculation npm module that is to simplify the calculation of permutations and combinations",
    "syncmovie": "On Syncmovie, you can watch YouTube videos with someone, and it will sync together. Besides, You can see how many people are connecting.",
    "iso-639-1-jp": "Conversion module of ISO-639 language code to Japanese name.",
    "bullshit-trivia": "Bullshit Trivia provides tidbits that you won't use for the rest of your life. Waste your time with useless trivia facts.",
    "kec": "Kota Extension Converter is Image format extension converter written in Golang. Only for jpg/png/gif image, but I have been coding for SVG conversion."
  },
  "media": {
    "g0v": "Technology summit held by g0v:The biggest civic tech community in Taiwan. I talked on the subject of my job as a student intern at Code for Japan and event/contest we held."
  }
}
