{
  "intro": "Hi there 👋\nI’m a front-end developer && high school student living in Japan. I have interest in algorithms which are not related to competitive programming such as hash, compression, cryptographic algorithm. Also, I’m studying SSI (Self-sovereign Identity) for my senior thesis in high school. Since I am going to study abroad this year, my whole ongoing projects are going to stop from the second half of this year to the first half of the next year.\n I’m currently working as an event management intern at Code for Japan. If you have any question about me/my project, feel free to send an email or contact me on Twitter!\n",
  "skills": {
    "jsts": "My main language. I usually use them for front-end, and also when learning algorithm in order not to make it hard to learn because of language.",
    "svelte": "Since the ecosystem is not expanded as much as Nuxt.js, I usually use Svelte for small website such as this portfolio website.",
    "nuxt": "I used Nuxt.js for the first time at the hackathon held this spring, means I’m not familiar with this framwork yet, but I like to use this as the main framework.",
    "firebase": "Firestore is totally suitable for me since I like KVS. Currently I’m working on the project which use AWS cognito, but I usually use Firebase Authentication for authentication backend.",
    "ras": "As a hobby, I’ve set up my own NAS server on Rasberry Pi 4. I’m going to set up VPN server to connect to NAS outside my house.",
    "go": "I made integrated RSS feed of my blogs (note, Zenn, blog.kota-yata.com), and image file extension converter in Go. I’m using Go just as a hobby, but I hope I can use this language as my main one someday."
  },
  "works": {
    "sha256": "SHA-256 implementation from scratch in TypeScript. It was really hard to deal with full-width symbols like Japanese and emoji.",
    "huffman": "Huffman Coding Algorithm written in TypeScript. You can encode/decode ASCII string.",
    "slouch": "Markdown editor which enables to edit local document from browser and overwrite them. You can also save the documents in cloud database.",
    "pics": "My personal photo gallery. You can search tags from the upper right search box. Though not every photo was taken by DSLR, my good old days are in this place :)",
    "summarizy": "Markdown memo app which make it easy to summarize while reading the paper or tech document. Memo area on left side is WYSIWYG editor so that there’s no preview.",
    "percom": "Permutation & Combination library. Since it’s little backbreaking to implement permutation or combination, I recommend to use this library instead.",
    "neornd": "A library which do boring random stuff instead of you. Random sorting, generating random number/string are availble on this library. Don’t use Math.random() for essential contents.",
    "iso": "ISO’s country code to country name in Japanese converter. Original repository is meikidd/iso-639-1.",
    "rss": "Integrated Feed of my blogs written in Golang. Including Zenn, note, blog.kota-yata.com. Available formats are RSS and JSON.",
    "kec": "Image format extension converter written in Golang. I'm looking for the suitable algorithm for resizing."
  },
  "extra": {
    "license": "Fundamental Engineering Japan",
    "award": "EPSON HackTrek 2021 First Prize 🥇",
    "favorite": "Cycling, Rebuild.fm, KANDYTOWN, Eminem",
    "email": "kota@yatagai.com"
  }
}
