{
  "intro": "日本に住んでるフロントエンド開発者です。最近暗号や圧縮系のアルゴリズムに興味をもち、実際に実装をしてみるなど勉強を進めています。高校の卒業研究ではブロックチェーンとSSIを使った研究をする予定で、そのために今必死でVC/DIDの仕様書を読んでいます。\n今年の夏からアメリカに留学予定なので、今個人で開発しているプロジェクトや関わっている仕事は夏から1年間ストップする予定です。本当は去年行く予定だったんですが、さすがあの時期は厳しかったので今年再チャレンジという感じです。\n現在はCode for Japanでイベント運営のインターンとして働いています。僕のリポジトリやプロジェクトに関して質問がある方はメール、GitHub、もしくはTwitterでご連絡ください。",
  "skills": {
    "jsts": "最もよく使う言語です。言語仕様で戸惑うことが少ないため、フロントエンドだけでなくアルゴリズムの実装などにも使うことがあります。",
    "svelte": "Nuxtなど他のフレームワークほどエコシステムが発達していないため、比較的小規模なWebサイトで使います。ちなみにこのWebサイトもSvelteで作っています。",
    "nuxt": "2021年2月に初めて触ったのでまだ全く詳しくありませんが、フロントエンドのOSSはNuxt(Vue)で書かれていることが結構多いのでもっと勉強していきたいところです。",
    "firebase": "僕はKVSが好きなのでFirestoreをよく使っています。現在関わっているプロジェクトはAWSのCognitoを使っていますが、個人プロジェクトではFirebase Authenticationを使うことが多いです。",
    "ras": "趣味でラズパイ4でNASサーバーを立てています。VPNで繋がないとあまりNASの良さが出ないので近いうちにVPNサーバーも立てる予定です。",
    "go": "分散してる自分のブログRSSをまとめたり、画像の拡張子変換CLIを作ったりしています。まだググりながらなんとか書いている状況ですが、いつか静的解析とかもGoでやってみたいですね。"
  },
  "works": {
    "sha256": "ご存知SHA-256のTypeScriptでのフルスクラッチ実装です。論文読んでる時は楽しかったんですが最後の全角文字の対応にめちゃくちゃハマりました。",
    "huffman": "ハフマン符号のTypeScript実装。別に全角文字対応もできたんですが、なんかSHA256の時で嫌いになったので8bitsで区切るようにしています。",
    "slouch": "ローカルファイルをネイティブアプリみたいに編集でき、かつサービス上にも保存しておけるMarkdownエディタです。個人的に重宝しています。",
    "pics": "僕が撮った写真を上げているギャラリーです。ほとんどLAに行った時の写真で一眼ですらないんですが、見ていると懐かしくて癒されます。",
    "summarizy": "論文を読みながらMD形式でメモを取れるアプリです。いちいちPDFプレビューアプリとエディタを画面分割するのが面倒だったので作りました。WYSIWYGエディタなのでMDのプレビューはありません。",
    "percom": "組み合わせと順列の列挙&総数カウントができるライブラリです。去年に再帰を理解したくて作り、最近リファクタリングしてリーダブルなコードになりました。",
    "neornd": "Cryptoモジュールを使ってランダムな数値や文字列、ランダムソートをするライブラリです。Math.random()も結構進化しているようなので段々使い道は減っていくかもしれませんが、またそれも良し。",
    "iso": "ISOの国コードから日本語名に変換するライブラリです。英語版からForkしてTypeScriptへの移行やツールの変更を加えて公開しています。",
    "rss": "Goで書いた僕のブログフィードをまとめたフィードです。Zenn、note、個人ブログのRSSを取ってきて、新しいフィードに統合してRSSとJSON形式で配信しています。",
    "kec": "Goで書いた、画像拡張子変換のCLIです。jpg/png/gifに対応していて、画像圧縮も一応作ったのですが、結構画像が荒くなったのでここのアルゴリズムも良いものを探していきたいです。"
  },
  "extra": {
    "license": "基本情報技術者",
    "award": "EPSON HackTrek 2021 優勝🥇",
    "favorite": "自転車, Rebuild.fm, KANDYTOWN, Eminem",
    "email": "kota@yatagai.com"
  }
}
